{
    "GlobalParemeterSet": {
        "Environment": "Global",
        "PWDLength": "16",
        "UseCSVRelativePasth": "MLZ-Admin-List.csv",
        "MissionAUs": [
            "Alpha",
            "Bravo",
            "Charlie"
        ],
        "LicenseSKUId": "c42b9cae-ea4f-4ab7-9717-81576235ccac",
        "PKIConfig": "DOD",
        "comments": "Update these global parameters."
    },
    "StepParameterSet": {
        "PSTools": {
            "id": "01",
            "description": "1_MLZ_Install_Tools",
            "runstep": true,
            "comments": "Installs MS Graph PowerShell and Azure AD Preview modules.",
            "parameters": {  
                "Modules": [  
                    "Microsoft.Graph.PowerShell",  
                    "AzureADPreview"
                ]
            }
        },
        "AdminUnits": {
            "id": "02",
            "description": "Creates Admin Units for MLZ Core Administration",
            "runstep": true,
            "parameters": {
                "AdministrativeUnits": [
                    {
                        "DisplayName": "MLZ Core Users",
                        "Description": "Contains users with management access for MLZ core subscriptions",
                        "MembershipType": "Static"
                    },
                    {
                        "DisplayName": "MLZ Core RBAC Groups",
                        "Description": "Contains groups created by the MLZ identity add-on for assigning RBAC roles for MLZ subscriptions.",
                        "MembershipType": "Static"
                    }
                ],
                "MissionAUTemplates": [
                    {
                        "DisplayName": "Mission XX RBAC Groups",
                        "Description": "Contains groups created by the MLZ identity add-on for assigning RBAC roles for Mission spoke subscriptions.",
                        "MembershipType": "Static"
                    },
                    {
                        "DisplayName": "Mission XX Users",
                        "Description": "Contains users with management access for Mission spoke subscriptions.",
                        "MembershipType": "Static"
                    }
                ]
            }
        },
        "EmergencyAccess": {
            "id": "03",
            "description": "Creates Emergency Access Accounts",
            "runstep": true,
            "comments": "",
            "parameters": {
                "Users": [
                    {
                        "UserPrincipalName": "MLZEA01",
                        "DisplayName": "MLZ Emergency 01",
                        "MailNickname": "MLZEA01"
                    },
                    {
                        "UserPrincipalName": "MLZEA02",
                        "DisplayName": "MLZ Emergency 02",
                        "MailNickname": "MLZEA02"
                    }
                ],
                "EAGroup": {
                    "displayName": "Emergency Access Accounts",
                    "description": "Contains the break-glass accounts for the MLZ environment.",
                    "isAssignableToRole": true,
                    "mailEnabled": false,
                    "securityEnabled": true
                }
            }
        },
        "NamedAccounts": {
            "id": "04",
            "description": "Creates named administrator accounts for managing MLZ.",
            "runstep": true,
            "comments": "",
            "parameters": { 
                "Users": {
                    "UserCSV": "MLZ-Admin.List.csv",
                    "LicenseGroupName": "MLZ-License-AADP2",
                    "MissionCode": "MLZ-Core"
                },
                "LicenseGroup": {
                    "displayName": "MLZ-Licensing-P2",
                    "description": "Licenses new users for Azure AD Premium P2",
                    "groupTypes": [
                        "DynamicMembership"
                    ],
                    "mailEnabled": false,
                    "membershipRule": "(user.userType -eq \"Member\")",
                    "membershipRuleProcessingState": "On"
                }
            }
        },
        "AuthNMethods": {
            "id": "05",
            "description": "Configures Passwordless Authentication Methods for MLZ tenant.",
            "runstep": true,
            "comments": "",
            "parameters": {
                "AuthenticationMethodsConfigurations": [
                    {
                        "id": "Fido2",
                        "state": "enabled",
                        "isSelfServiceRegistrationAllowed": true,
                        "isAttestationEnforced": false,
                        "includeTargets": [
                            {
                                "targetType": "group",
                                "id": "all_users",
                                "isRegistrationRequired": false
                            }
                        ]
                    },
                    {
                        "id": "MicrosoftAuthenticator",
                         "state": "enabled",
                        "featureSettings": {
                            "displayAppInformationRequiredState": {
                                "state": "default",
                                "includeTarget": {
                                    "targetType": "group",
                                    "id": "all_users"
                                }
                            },
                            "displayLocationInformationRequiredState": {
                                "state": "default",
                                "includeTarget": {
                                    "targetType": "group",
                                    "id": "all_users"
                                }
                            }
                        },
                        "includeTargets": [
                            {
                                "targetType": "group",
                                "id": "all_users",
                                "isRegistrationRequired": false,
                                "authenticationMode": "any"
                            }
                        ]   
                    },
                    {
                        "id": "X509Certificate",
                        "state": "enabled",
                        "certificateUserBindings": [
                            {
                                "x509CertificateField": "PrincipalName",
                                "userProperty": "certificateUserIds",
                                "priority": 1
                            },
                            {
                                "x509CertificateField": "PrincipalName",
                                "userProperty": "onPremisesUserPrincipalName",
                                "priority": 2
                            }
                        ],
                        "authenticationModeConfiguration": {
                            "x509CertificateAuthenticationDefaultMode": "x509CertificateMultiFactor"
                        },
                        "includeTargets@odata.context": "https://graph.microsoft.com/v1.0/$metadata#authenticationMethodsPolicy/authenticationMethodConfigurations('X509Certificate')/microsoft.graph.x509CertificateAuthenticationMethodConfiguration/includeTargets",
                        "includeTargets": [
                            {
                                "targetType": "group",
                                "id": "all_users",
                                "isRegistrationRequired": false
                            }
                        ]
                    }
                ]
            }
        },
        "CBA": {
            "id": "06",
            "description": "Configures CBA for DOD CAC",
            "comments": "This could include the exact CBA configuration and certificates for DOD PKI. Need ability to upload certificates via MS Graph PowerShell."
        },
        "Groups": {
            "id": "07",
            "description": "Creates RBAC groups for MLZ",
            "runstep": true,
            "comments": "",
            "parameters": {
                "Groups": [
                    {
                        "type": "Security",
                        "permission": "AzureRBAC",
                        "runsubstep": true,
                        "Groups": [
                            {
                                "name": "Platform Owner",
                                "scope": [
                                    "core"
                                ],
                                "description": "MLZ - User Access Administrator at the highest management group under /"
                            },
                            {
                                "name": "Subscription Owner",
                                "scope": [
                                    "core",
                                    "mission"
                                ],
                                "description": "MLZ - Subscription owner"
                            },
                            {
                                "name": "Security Operations",
                                "scope": [
                                    "core"
                                ],
                                "description": "MLZ - Sentinel contributor, Logic Apps Contributor, Security Reader."
                            },
                            {
                                "name": "Subscription Contributor",
                                "scope": [
                                    "core",
                                    "mission"
                                ],
                                "description": "MLZ - Subscription contributor"
                            },
                            {
                                "name": "Subscription Reader",
                                "scope": [
                                    "core",
                                    "mission"
                                ],
                                "description": "MLZ - Subscription Reader"
                            },
                            {
                                "name": "Subscription Owner No Network Write",
                                "scope": [
                                    "core",
                                    "mission"
                                ],
                                "description": "MLZ - custom role that grants owner with exception of network write permissions."
                            },
                            {
                                "name": "Application Owners (DevOps)",
                                "scope": [
                                    "core",
                                    "mission"
                                ],
                                "description": "MLZ - custom role for Application Owners."
                            }
                        ]
                    },
                    {
                        "type": "PAG",
                        "permission": "AAD",
                        "runsubstep": true,
                        "Groups": [
                            {
                                "name": "RBAC Groups Administrator",
                                "scope": [
                                    "core",
                                    "mission"
                                ],
                                "description": "MLZ - Group Administrator scoped to Administrative Unit."
                            },
                            {
                                "name": "User Administrator",
                                "scope": [
                                    "core",
                                    "mission"
                                ],
                                "description": "MLZ - User Administrator scoped to Administrative Unit."
                            },
                            {
                                "name": "Application Developers",
                                "scope": [
                                    "core"
                                ],
                                "description": "MLZ - Application Developer group."
                            }
                        ]
                    }
                ]
            } 
        },
        "PIM": {
            "id": "08",
            "description": "Configure Privileged Identity Management Roles",
            "runstep": true,
            "comments": "To Do: approvals and notifications, custom roles",
            "parameters": {
                "CreateAdminUnits": "True",
                "Roles": [
                    {
                        "name": "Global Administrator",
                        "scope": [
                            "tenant"
                        ],
                        "eligibility": "180d",
                        "duration": "4h"
                    },
                    {
                        "name": "Application Administrator",
                        "scope": [
                            "tenant"
                        ],
                        "eligibility": "180d",
                        "duration": "4h"
                    },
                    {
                        "name": "Application Developer",
                        "scope": [
                            "tenant"
                        ],
                        "eligibility":"180d",
                        "duration": "4h"
                    },
                    {
                        "name": "Group Administrator",
                        "scope": [
                            "tenant",
                            "mission"
                        ],
                        "eligibility": "180d",
                        "duration": "4h"
                    },
                    {
                        "name": "User Administrator",
                        "scope": [
                            "tenant",
                            "mission"
                        ],
                        "eligibility": "180d",
                        "duration": "4h"
                    }
                ]
            }
        },
        "ConditionalAccess": {
            "id": "09",
            "description": "Configures Conditional Access for MLZ baseline",
            "runstep": true,
            "comments": "Excludes current user and Break Glass accounts from each role. Report Only for now",
            "parameters": {
                "rules": [
                    {
                        "displayname": "MLZ001: MFA - Require multifactor authentication for all users",
                        "state": "enabledForReportingButNotEnforced",
                        "sessionControls": null,
                        "conditions": {
                            "clientAppTypes": [
                                "all"
                            ],
                            "servicePrincipalRiskLevels": [],
                            "platforms": null,
                            "locations": null,
                            "times": null,
                            "deviceStates": null,
                            "devices": null,
                            "clientApplications": null,
                            "applications": {
                                "includeApplications": [
                                    "All"
                                ],
                                "excludeApplications": [],
                                "includeUserActions": [],
                                "includeAuthenticationContextClassReferences": []
                            },
                            "users": {
                                "includeUsers": [
                                    "All"
                                ],
                                "excludeUsers": [],
                                "includeGroups": [],
                                "excludeGroups": [],
                                "includeRoles": [],
                                "excludeRoles": [],
                                "includeGuestsOrExternalUsers": null,
                                "excludeGuestsOrExternalUsers": null
                            }
                        },
                        "grantControls": {
                            "operator": "OR",
                            "builtInControls": [
                                "mfa"
                            ],
                            "customAuthenticationFactors": [],
                            "termsOfUse": [],
                            "authenticationStrength": null
                        }
                    },
                    {
                        "displayname": "MLZ002: MFA - Block Legacy Authentication",
                        "state": "enabledForReportingButNotEnforced",
                        "sessionControls": null,
                        "conditions": {
                            "userRiskLevels": [],
                            "signInRiskLevels": [],
                            "clientAppTypes": [
                                "exchangeActiveSync",
                                "other"
                            ],
                            "servicePrincipalRiskLevels": [],
                            "platforms": null,
                            "locations": null,
                            "times": null,
                            "deviceStates": null,
                            "devices": null,
                            "clientApplications": null,
                            "applications": {
                                "includeApplications": [
                                    "All"
                                ],
                                "excludeApplications": [],
                                "includeUserActions": [],
                                "includeAuthenticationContextClassReferences": []
                            },
                            "users": {
                                "includeUsers": [
                                    "All"
                                ],
                                "excludeUsers": [],
                                "includeGroups": [],
                                "excludeGroups": [],
                                "includeRoles": [],
                                "excludeRoles": [],
                                "includeGuestsOrExternalUsers": null,
                                "excludeGuestsOrExternalUsers": null
                            }
                        },
                        "grantControls": {
                            "operator": "OR",
                            "builtInControls": [
                                "block"
                            ],
                            "customAuthenticationFactors": [],
                            "termsOfUse": [],
                            "authenticationStrength": null
                        }
                    },
                    {
                        "displayname": "MLZ003: MFA - Securing security info registration",
                        "state": "enabledForReportingButNotEnforced",
                        "sessionControls": null,
                        "conditions": {
                            "userRiskLevels": [],
                            "signInRiskLevels": [],
                            "clientAppTypes": [
                                "all"
                            ],
                            "servicePrincipalRiskLevels": [],
                            "platforms": null,
                            "times": null,
                            "deviceStates": null,
                            "devices": null,
                            "clientApplications": null,
                            "applications": {
                                "includeApplications": [],
                                "excludeApplications": [],
                                "includeUserActions": [
                                    "urn:user:registersecurityinfo"
                                ],
                                "includeAuthenticationContextClassReferences": []
                            },
                            "users": {
                                "includeUsers": [
                                    "All"
                                ],
                                "excludeUsers": [
                                    "GuestsOrExternalUsers"
                                ],
                                "includeGroups": [],
                                "excludeGroups": [],
                                "includeRoles": [],
                                "excludeRoles": [
                                    "62e90394-69f5-4237-9190-012177145e10"
                                ],
                                "includeGuestsOrExternalUsers": null,
                                "excludeGuestsOrExternalUsers": null
                            },
                            "locations": {
                                "includeLocations": [
                                    "All"
                                ],
                                "excludeLocations": [
                                    "AllTrusted"
                                ]
                            }
                        },
                        "grantControls": {
                            "operator": "OR",
                            "builtInControls": [
                                "mfa"
                            ],
                            "customAuthenticationFactors": [],
                            "termsOfUse": [],
                            "authenticationStrength": null
                        }
                    },
                    {
                        "displayname": "MLZ004: Admins - Require phishing-resistant MFA for Azure AD admins",
                        "state": "enabledForReportingButNotEnforced",
                        "sessionControls": null,
                        "conditions": {
                            "userRiskLevels": [],
                            "signInRiskLevels": [],
                            "clientAppTypes": [
                                "all"
                            ],
                            "servicePrincipalRiskLevels": [],
                            "platforms": null,
                            "locations": null,
                            "times": null,
                            "deviceStates": null,
                            "devices": null,
                            "clientApplications": null,
                            "applications": {
                                "includeApplications": [
                                    "All"
                                ],
                                "excludeApplications": [],
                                "includeUserActions": [],
                                "includeAuthenticationContextClassReferences": []
                            },
                            "users": {
                                "includeUsers": [],
                                "excludeUsers": [],
                                "includeGroups": [],
                                "excludeGroups": [],
                                "includeRoles": [
                                    "62e90394-69f5-4237-9190-012177145e10",
                                    "194ae4cb-b126-40b2-bd5b-6091b380977d",
                                    "f28a1f50-f6e7-4571-818b-6a12f2af6b6c",
                                    "29232cdf-9323-42fd-ade2-1d097af3e4de",
                                    "b1be1c3e-b65d-4f19-8427-f6fa0d97feb9",
                                    "729827e3-9c14-49f7-bb1b-9608f156bbb8",
                                    "b0f54661-2d74-4c50-afa3-1ec803f12efe",
                                    "fe930be7-5e62-47db-91af-98c3a49a38b1",
                                    "c4e39bd9-1100-46d3-8c65-fb160da0071f",
                                    "9b895d92-2cd3-44c7-9d02-a6ac2d5ea5c3",
                                    "158c047a-c907-4556-b7ef-446551a6b5f7",
                                    "966707d0-3269-4727-9be2-8c3a10f19b9d",
                                    "7be44c8a-adaf-4e2a-84d6-ab2649e08a13",
                                    "e8611ab8-c189-46e8-94e1-60213ab1f814"
                                ],
                                "excludeRoles": [],
                                "includeGuestsOrExternalUsers": null,
                                "excludeGuestsOrExternalUsers": null
                            }
                        },
                        "grantControls": {
                            "operator": "OR",
                            "builtInControls": [],
                            "customAuthenticationFactors": [],
                            "termsOfUse": [],
                            "authenticationStrength": {
                                "id": "00000000-0000-0000-0000-000000000004",
                                "displayName": "Phishing resistant MFA",
                                "description": "Phishing-resistant, Passwordless methods for the strongest authentication, such as a FIDO2 security key",
                                "policyType": "builtIn",
                                "requirementsSatisfied": "mfa",
                                "allowedCombinations": [
                                    "windowsHelloForBusiness",
                                    "fido2",
                                    "x509CertificateMultiFactor"
                                ]
                            }
                        }
                    },
                    {
                        "displayname": "MLZ005: Admins - Require phishing-resistant MFA for Azure Management",
                        "state": "enabledForReportingButNotEnforced",
                        "sessionControls": null,
                        "conditions": {
                            "userRiskLevels": [],
                            "signInRiskLevels": [],
                            "clientAppTypes": [
                                "all"
                            ],
                            "servicePrincipalRiskLevels": [],
                            "platforms": null,
                            "locations": null,
                            "times": null,
                            "deviceStates": null,
                            "devices": null,
                            "clientApplications": null,
                            "applications": {
                                "includeApplications": [
                                    "797f4846-ba00-4fd7-ba43-dac1f8f63013"
                                ],
                                "excludeApplications": [],
                                "includeUserActions": [],
                                "includeAuthenticationContextClassReferences": []
                            },
                            "users": {
                                "includeUsers": [],
                                "excludeUsers": [],
                                "includeGroups": [],
                                "excludeGroups": [],
                                "includeRoles": [],
                                "excludeRoles": [],
                                "includeGuestsOrExternalUsers": null,
                                "excludeGuestsOrExternalUsers": null
                            }
                        },
                        "grantControls": {
                            "operator": "OR",
                            "builtInControls": [],
                            "customAuthenticationFactors": [],
                            "termsOfUse": [],
                            "authenticationStrength": {
                                "id": "00000000-0000-0000-0000-000000000004",
                                "displayName": "Phishing resistant MFA",
                                "description": "Phishing-resistant, Passwordless methods for the strongest authentication, such as a FIDO2 security key",
                                "policyType": "builtIn",
                                "requirementsSatisfied": "mfa",
                                "allowedCombinations": [
                                    "windowsHelloForBusiness",
                                    "fido2",
                                    "x509CertificateMultiFactor"
                                ]
                            }
                        }
                    },
                    {
                        "displayname": "MLZ006: Risk - Require password change for high risk users",
                        "state": "enabledForReportingButNotEnforced",
                        "sessionControls": null,
                        "conditions": {
                            "userRiskLevels": [
                                "high"
                            ],
                            "signInRiskLevels": [],
                            "clientAppTypes": [
                                "all"
                            ],
                            "servicePrincipalRiskLevels": [],
                            "platforms": null,
                            "locations": null,
                            "times": null,
                            "deviceStates": null,
                            "devices": null,
                            "clientApplications": null,
                            "applications": {
                                "includeApplications": [
                                    "All"
                                ],
                                "excludeApplications": [],
                                "includeUserActions": [],
                                "includeAuthenticationContextClassReferences": []
                            },
                            "users": {
                                "includeUsers": [
                                    "None"
                                ],
                                "excludeUsers": [],
                                "includeGroups": [],
                                "excludeGroups": [],
                                "includeRoles": [],
                                "excludeRoles": [],
                                "includeGuestsOrExternalUsers": null,
                                "excludeGuestsOrExternalUsers": null
                            }
                        },
                        "grantControls": {
                            "operator": "AND",
                            "builtInControls": [
                                "passwordChange"
                            ],
                            "customAuthenticationFactors": [],
                            "termsOfUse": [],
                            "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#policies/conditionalAccessPolicies('f9520094-accc-48cd-a616-8f58f14e9622')/grantControls/authenticationStrength/$entity",
                            "authenticationStrength": null
                        }
                    },
                    {
                        "displayname": "MLZ007: Risk - Require passwordless MFA for medium risk sign ins",
                        "state": "enabledForReportingButNotEnforced",
                        "sessionControls": null,
                        "conditions": {
                            "userRiskLevels": [],
                            "signInRiskLevels": [
                                "high",
                                "medium"
                            ],
                            "clientAppTypes": [
                                "all"
                            ],
                            "servicePrincipalRiskLevels": [],
                            "platforms": null,
                            "locations": null,
                            "times": null,
                            "deviceStates": null,
                            "devices": null,
                            "clientApplications": null,
                            "applications": {
                                "includeApplications": [
                                    "None"
                                ],
                                "excludeApplications": [],
                                "includeUserActions": [],
                                "includeAuthenticationContextClassReferences": []
                            },
                            "users": {
                                "includeUsers": [
                                    "None"
                                ],
                                "excludeUsers": [],
                                "includeGroups": [],
                                "excludeGroups": [],
                                "includeRoles": [],
                                "excludeRoles": [],
                                "includeGuestsOrExternalUsers": null,
                                "excludeGuestsOrExternalUsers": null
                            }
                        },
                        "grantControls": {
                            "operator": "OR",
                            "builtInControls": [],
                            "customAuthenticationFactors": [],
                            "termsOfUse": [],
                            "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#policies/conditionalAccessPolicies('cdb1b0fa-adae-4a03-a458-e322248fbbf1')/grantControls/authenticationStrength/$entity",
                            "authenticationStrength": {
                                "id": "00000000-0000-0000-0000-000000000003",
                                "createdDateTime": "2021-12-01T08:00:00Z",
                                "modifiedDateTime": "2021-12-01T08:00:00Z",
                                "displayName": "Passwordless MFA",
                                "description": "Passwordless methods that satisfy strong authentication, such as Passwordless sign-in with the Microsoft Authenticator",
                                "policyType": "builtIn",
                                "requirementsSatisfied": "mfa",
                                "allowedCombinations": [
                                    "windowsHelloForBusiness",
                                    "fido2",
                                    "x509CertificateMultiFactor",
                                    "deviceBasedPush"
                                ]
                            }
                        }
                    }
                ]
            }
        },
        "TenantPolicies": {
            "id": "10",
            "description": "Apply user, group, application, external collaboration settings.",
            "runstep": true,
            "comments": "",
            "parameters": {
                "authorizationPolicy": {
                    "allowInvitesFrom": "adminsAndGuestInviters",
                    "allowedToSignUpEmailBasedSubscriptions": true,
                    "allowedToUseSSPR": true,
                    "allowEmailVerifiedUsersToJoinOrganization": false,
                    "allowUserConsentForRiskyApps": null,
                    "blockMsolPowerShell": false,
                    "enabledPreviewFeatures": [],
                    "guestUserRoleId": "10dae51f-b6af-4016-8d66-8c2a99b929b3",
                    "permissionGrantPolicyIdsAssignedToDefaultUserRole": [
                        "ManagePermissionGrantsForSelf.microsoft-user-default-legacy"
                    ],
                    "defaultUserRolePermissions": {
                        "allowedToCreateApps": false,
                        "allowedToCreateSecurityGroups": true,
                        "allowedToCreateTenants": false,
                        "allowedToReadBitlockerKeysForOwnedDevice": true,
                        "allowedToReadOtherUsers": true
                        }
                },
                "externalIdentityPolicy": {
                    "allowExternalIdentitiesToLeave": true,
                    "allowDeletedIdentitiesDataRemoval": false
                },
                "adminConsentRequestPolicy": {
                    "isEnabled": false
                }
            }
        },
        "EntitlementsManagement": {
            "id": "11",
            "description": "Configures Entitlements Management Access packages for each Mission.",
            "runstep": false,
            "comments": "Placeholder."
        }
    }
}